<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"4b6aa7c2e724868a152c668c4c734e6d05ddcd0db2941b528b783ebb22be4979","plan_job_ref":"Job Staging Environment #86 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9537495644","plan_out_hash":"8a6f4422ce6faa60ed1eac80041924b94cf1823494953dc712376a5f389dd4a8","plan_hash":"0a6a08917b38a19250afd3f4fed082885a37cd182a35d51e3bfb88cb85e204d2","plan_text_format":"diff","version":"1.43.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 11 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_route53_record.route-records will be updated in-place
!~  resource "aws_route53_record" "route-records" {
        id                               = "Z0822301268JPSC1M6XE6_dev.dennisowie.com_A"
        name                             = "dev.dennisowie.com"
#        (8 unchanged attributes hidden)

!~      alias {
!~          evaluate_target_health = false -> true
            name                   = "d5hv66lvd6lci.cloudfront.net"
#            (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.Fonarto will be created
+   resource "aws_s3_object" "Fonarto" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "application/x-font-ttf"
+       etag                   = "b114f64e2461f6359b765880e98a7cf6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "Fonarto.ttf"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/Fonarto.ttf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.Fonarto-XT will be created
+   resource "aws_s3_object" "Fonarto-XT" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "application/x-font-ttf"
+       etag                   = "40b99741ccb0659491c1f4d2a6931e4f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "Fonarto-XT.ttf"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/Fonarto-XT.ttf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.NexaRustScriptL will be created
+   resource "aws_s3_object" "NexaRustScriptL" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "font/otf"
+       etag                   = "d18ea74c2fbc82d51ac4b8a1f569a9db"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "NexaRustScriptL-0.otf"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/NexaRustScriptL-0.otf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.Raleway-Regular will be created
+   resource "aws_s3_object" "Raleway-Regular" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "application/x-font-ttf"
+       etag                   = "6e4a9679e65cc320746c3e5d48e51f28"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "Raleway-Regular.ttf"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/Raleway-Regular.ttf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.Ubuntu-L will be created
+   resource "aws_s3_object" "Ubuntu-L" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "application/x-font-ttf"
+       etag                   = "8571edb1bb4662f1cdba0b80ea0a1632"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "Ubuntu-L.ttf"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/Ubuntu-L.ttf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.argocd will be created
+   resource "aws_s3_object" "argocd" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "4575a61a9a87cced908231eb770a3b28"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "argocd.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/argocd.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.fhs-banner will be created
+   resource "aws_s3_object" "fhs-banner" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "e1a46b1230afd491d2e0b0bc9e3b0e7d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "fhs-banner.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/fhs-banner.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.flaskapp-with-numbersapi will be created
+   resource "aws_s3_object" "flaskapp-with-numbersapi" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "80710b6a549d020d2d368e0be5705ac6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "flaskapp-with-numbersapi.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/flaskapp-with-numbersapi.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.jenkins-gitlab will be created
+   resource "aws_s3_object" "jenkins-gitlab" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "06876b4ae8611d6c26e22e2dbebd1d53"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "jenkins-gitlab.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/jenkins-gitlab.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.main-css will be updated in-place
!~  resource "aws_s3_object" "main-css" {
!~      etag                          = "23762e5eb65f7db4329d84096dcdd201" -> "5b22dc33e51e1e2f34fa6fe84ca4630d"
        id                            = "main.css"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.main-js will be updated in-place
!~  resource "aws_s3_object" "main-js" {
!~      etag                          = "840a9a42fcd550d12c040c3ae8620283" -> "2a424b1e6bff8ce6dbad54e3e2b69cb6"
        id                            = "main.js"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                          = "e981a0260d4f2476403490680a522c2b" -> "41cacbafae2b2ced5d0d950380fcd015"
        id                            = "index.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (24 unchanged attributes hidden)
    }

  # aws_s3_object.photo will be updated in-place
!~  resource "aws_s3_object" "photo" {
!~      content_type                  = "application/javascript" -> "image/jpeg"
        id                            = "pic01-vintage2.jpg"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.s3-pipeline will be created
+   resource "aws_s3_object" "s3-pipeline" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "dc91468c303aedd7aa1878a1ce0b8281"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "s3-pipeline.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/s3-pipeline.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.vees-banner will be created
+   resource "aws_s3_object" "vees-banner" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "54983320c2fa0c98cd34bc8ba93417ca"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "vees-banner.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/vees-banner.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

Plan: 11 to add, 7 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #86](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9537495644)